test_sample_app/app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'vara.nagalla@gmail.com' LIMIT 1
---
  def create
    user = User.find_by_email(params[:session][:email])